ZigEmbeddedGroup/microzig/port/gigadevice/gd32/src/chips/GD32VF103.svd
       <register>
          <name>CLICINTIP_37</name>
          <displayName>CLICINTIP_37</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1094</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_38</name>
          <displayName>CLICINTIP_38</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1098</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_39</name>
          <displayName>CLICINTIP_39</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x109C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_40</name>
          <displayName>CLICINTIP_40</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10A0</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_41</name>
          <displayName>CLICINTIP_41</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10A4</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_42</name>
          <displayName>CLICINTIP_42</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10A8</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_43</name>
          <displayName>CLICINTIP_43</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10AC</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_44</name>
          <displayName>CLICINTIP_44</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10B0</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_45</name>
          <displayName>CLICINTIP_45</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10B4</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_46</name>
          <displayName>CLICINTIP_46</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10B8</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_47</name>
          <displayName>CLICINTIP_47</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10BC</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_48</name>
          <displayName>CLICINTIP_48</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10C0</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_49</name>
          <displayName>CLICINTIP_49</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10C4</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_50</name>
          <displayName>CLICINTIP_50</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10C8</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_51</name>
          <displayName>CLICINTIP_51</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10CC</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_52</name>
          <displayName>CLICINTIP_52</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10D0</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_53</name>
          <displayName>CLICINTIP_53</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10D4</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_54</name>
          <displayName>CLICINTIP_54</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10D8</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_55</name>
          <displayName>CLICINTIP_55</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10DC</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_56</name>
          <displayName>CLICINTIP_56</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10E0</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_57</name>
          <displayName>CLICINTIP_57</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10E4</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_58</name>
          <displayName>CLICINTIP_58</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10E8</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_59</name>
          <displayName>CLICINTIP_59</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10EC</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_60</name>
          <displayName>CLICINTIP_60</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10F0</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_61</name>
          <displayName>CLICINTIP_61</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10F4</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_62</name>
          <displayName>CLICINTIP_62</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10F8</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_63</name>
          <displayName>CLICINTIP_63</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x10FC</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_64</name>
          <displayName>CLICINTIP_64</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1100</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_65</name>
          <displayName>CLICINTIP_65</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1104</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_66</name>
          <displayName>CLICINTIP_66</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1108</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_67</name>
          <displayName>CLICINTIP_67</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x110C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CLICINTIP_68</name>
          <displayName>CLICINTIP_68</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1110</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_69</name>
          <displayName>CLICINTIP_69</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1114</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_70</name>
          <displayName>CLICINTIP_70</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1118</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_71</name>
          <displayName>CLICINTIP_71</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x111C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_72</name>
          <displayName>CLICINTIP_72</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1120</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_73</name>
          <displayName>CLICINTIP_73</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1124</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_74</name>
          <displayName>CLICINTIP_74</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1128</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_75</name>
          <displayName>CLICINTIP_75</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x112C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_76</name>
          <displayName>CLICINTIP_76</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1130</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_77</name>
          <displayName>CLICINTIP_77</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1134</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_78</name>
          <displayName>CLICINTIP_78</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1138</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
