ZigEmbeddedGroup/microzig/port/gigadevice/gd32/src/chips/GD32VF103.svd
      <register>
          <name>CLICINTIP_79</name>
          <displayName>CLICINTIP_79</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x113C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_80</name>
          <displayName>CLICINTIP_80</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1140</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_81</name>
          <displayName>CLICINTIP_81</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1144</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_82</name>
          <displayName>CLICINTIP_82</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1148</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_83</name>
          <displayName>CLICINTIP_83</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x114C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_84</name>
          <displayName>CLICINTIP_84</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1150</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_85</name>
          <displayName>CLICINTIP_85</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x1158</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CLICINTIP_86</name>
          <displayName>CLICINTIP_86</displayName>
          <description>clicintip  Register</description>
          <addressOffset>0x115C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIE_0</name>
          <displayName>CLICINTIE_0</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1001</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           </fields>
        </register>
       <register>
          <name>CLICINTIE_1</name>
          <displayName>CLICINTIE_1</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1005</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_2</name>
          <displayName>CLICINTIE_2</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1009</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_3</name>
          <displayName>CLICINTIE_3</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x100D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_4</name>
          <displayName>CLICINTIE_4</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1011</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_5</name>
          <displayName>CLICINTIE_5</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1015</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_6</name>
          <displayName>CLICINTIE_6</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1019</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_7</name>
          <displayName>CLICINTIE_7</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x101D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_8</name>
          <displayName>CLICINTIE_8</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1021</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_9</name>
          <displayName>CLICINTIE_9</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1025</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_10</name>
          <displayName>CLICINTIE_10</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1029</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_11</name>
          <displayName>CLICINTIE_11</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x102D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_12</name>
          <displayName>CLICINTIE_12</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1031</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_13</name>
          <displayName>CLICINTIE_13</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1035</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_14</name>
          <displayName>CLICINTIE_14</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1039</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_15</name>
          <displayName>CLICINTIE_15</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x103D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_16</name>
          <displayName>CLICINTIE_16</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1041</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_17</name>
          <displayName>CLICINTIE_17</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1045</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_18</name>
          <displayName>CLICINTIE_18</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1049</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_19</name>
          <displayName>CLICINTIE_19</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x104D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_20</name>
          <displayName>CLICINTIE_20</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1051</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_21</name>
          <displayName>CLICINTIE_21</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1055</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_22</name>
          <displayName>CLICINTIE_22</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1059</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_23</name>
          <displayName>CLICINTIE_23</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x105D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_24</name>
          <displayName>CLICINTIE_24</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1061</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_25</name>
          <displayName>CLICINTIE_25</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1065</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_26</name>
          <displayName>CLICINTIE_26</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1069</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_27</name>
          <displayName>CLICINTIE_27</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x106D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_28</name>
          <displayName>CLICINTIE_28</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1071</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_29</name>
          <displayName>CLICINTIE_29</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1075</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_30</name>
          <displayName>CLICINTIE_30</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1079</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_31</name>
          <displayName>CLICINTIE_31</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x107D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_32</name>
          <displayName>CLICINTIE_32</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1081</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
       <register>
          <name>CLICINTIE_33</name>
          <displayName>CLICINTIE_33</displayName>
          <description>clicintie Register</description>
          <addressOffset>0x1085</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>
        </register>
