ZigEmbeddedGroup/microzig/port/gigadevice/gd32/src/chips/GD32VF103.svd
      <register>
          <name>CLICINTATTR_85</name>
          <displayName>CLICINTIE_85</displayName>
          <description>clicintattr Register</description>
          <addressOffset>0x1156</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
         </fields>
        </register>       
      <register>
          <name>CLICINTATTR_86</name>
          <displayName>CLICINTIE_86</displayName>
          <description>clicintattr Register</description>
          <addressOffset>0x115A</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
         </fields>
        </register>

      <register>
          <name>CLICINTCTL_0</name>
          <displayName>CLICINTCTL_0</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1003</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_1</name>
          <displayName>CLICINTCTL_1</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1007</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_2</name>
          <displayName>CLICINTCTL_2</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x100B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_3</name>
          <displayName>CLICINTCTL_3</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x100F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_4</name>
          <displayName>CLICINTCTL_4</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1013</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_5</name>
          <displayName>CLICINTCTL_5</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1017</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_6</name>
          <displayName>CLICINTCTL_6</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x101B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_7</name>
          <displayName>CLICINTCTL_7</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x101F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_8</name>
          <displayName>CLICINTCTL_8</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1023</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_9</name>
          <displayName>CLICINTCTL_9</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1027</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_10</name>
          <displayName>CLICINTCTL_10</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x102B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_11</name>
          <displayName>CLICINTCTL_11</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x102F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_12</name>
          <displayName>CLICINTCTL_12</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1033</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_13</name>
          <displayName>CLICINTCTL_13</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1037</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_14</name>
          <displayName>CLICINTCTL_14</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x103B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_15</name>
          <displayName>CLICINTCTL_15</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x103F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_16</name>
          <displayName>CLICINTCTL_16</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1043</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_17</name>
          <displayName>CLICINTCTL_17</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1047</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_18</name>
          <displayName>CLICINTCTL_18</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x104B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_19</name>
          <displayName>CLICINTCTL_19</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x104F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_20</name>
          <displayName>CLICINTCTL_20</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1053</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_21</name>
          <displayName>CLICINTCTL_21</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1057</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_22</name>
          <displayName>CLICINTCTL_22</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x105B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_23</name>
          <displayName>CLICINTCTL_23</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x105F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_24</name>
          <displayName>CLICINTCTL_24</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1063</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_25</name>
          <displayName>CLICINTCTL_25</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1067</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_26</name>
          <displayName>CLICINTCTL_26</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x106B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_27</name>
          <displayName>CLICINTCTL_27</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x106F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_28</name>
          <displayName>CLICINTCTL_28</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1073</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_29</name>
          <displayName>CLICINTCTL_29</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1077</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_30</name>
          <displayName>CLICINTCTL_30</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x107B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_31</name>
          <displayName>CLICINTCTL_31</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x107F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_32</name>
          <displayName>CLICINTCTL_32</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1083</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_33</name>
          <displayName>CLICINTCTL_33</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1087</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_34</name>
          <displayName>CLICINTCTL_34</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x108B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_35</name>
          <displayName>CLICINTCTL_35</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x108F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
     <register>
          <name>CLICINTCTL_36</name>
          <displayName>CLICINTCTL_36</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1093</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
      <register>
          <name>CLICINTCTL_37</name>
          <displayName>CLICINTCTL_37</displayName>
          <description>clicintctl Register</description>
          <addressOffset>0x1097</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
         </fields>
        </register>   
